dreamted/TRIO_MR_MD/2.TRIO-MR/appl_stm207_20141204_RvsALC_20151223/STM32F2xx_StdPeriph_Driver_v1212/src/stm32f2xx_usart2_1208.c
	if(((nLCR >> 0) & 0x03) == (_NONPARITY >> 0)){
		USART_InitStructure.USART_Parity = USART_Parity_No;
	}
	else if(((nLCR >> 0) & 0x03) == (_ODDPARITY >> 0)){
		USART_InitStructure.USART_Parity = USART_Parity_Odd;
	}
	else{
		USART_InitStructure.USART_Parity = USART_Parity_Even;
	}
	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	/* USART configuration */
	USART_Init(USART2, &USART_InitStructure);

#if defined (OS_INCLUDED) 
	pUSART2.sem = OSSemCreate(1);
#endif
	/* Enable USART */
	USART_Cmd(USART2, ENABLE);

	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
	NVIC_Init(USART2_IRQn, ENABLE); 

	USART2Printf("\n");	
}

/*******************************************************************************
  * @brief  Interrupt handler USART2 global interrupt request
  * @param  None 
  * @retval None
  *****************************************************************************/
void USART2_IRQIntHandler(void)
{

	INT16U tmp = USART2->SR;

#ifdef OS_INCLUDED
	INT32U cpu_sr;
	CPU_CRITICAL_ENTER();                                       // Tell uC/OS-II that we are starting an ISR
	OSIntNesting++;
	CPU_CRITICAL_EXIT();
#endif /* OS_INCLUDED */
	// Rx Data Received
	if(tmp & ( 1 << __RXNE))
	{
		Rx2Buff[Rx2WrCnt%Rx2BuffLen] = USART2->DR;		// When the receive register is read, the RDR bit is automatically cleared.
		if(++Rx2WrCnt >= Rx2BuffLen) Rx2WrCnt = 0;
	}
	else if(tmp & ( 1 << __TXE))
	{
		if(Tx2RdCnt != Tx2WrCnt)
		{
			USART2->DR = Tx2Buff[Tx2RdCnt%Tx2BuffLen];
			if(++Tx2RdCnt >= Tx2BuffLen ) Tx2RdCnt = 0;
		}
		else USART2->__B.CR1.TXEIE = DISABLE;
	}
	else // error, dummy read
	{
		tmp =  USART2->DR;
	}

#ifdef OS_INCLUDED
	OSIntExit();												// Tell uC/OS-II that we are leaving the ISR
#endif /* OS_INCLUDED */

}

unsigned char USART2PutToBuffer(unsigned char Data)
{
#ifdef OS_INCLUDED
	INT8U err;
	//////////////////////////////////////////////////

	OSSemPend(pUSART2.sem, 0, &err);
#endif /* OS_INCLUDED */
	//////////////////////////////////////////////////
	Tx2Buff[Tx2WrCnt%Tx2BuffLen] = Data;
	if(++Tx2WrCnt >= Tx2BuffLen) Tx2WrCnt = 0;
	
	USART2->__B.CR1.TXEIE = ENABLE; 		
	///////////////////////////////////////////////////
#ifdef OS_INCLUDED
	OSSemPost(pUSART2.sem);
#endif /* OS_INCLUDED */

	return 0;
}



//Not using interrupt
unsigned char USART2PutChar(unsigned char Data)
{
	#ifdef OS_INCLUDED
		INT8U err;
		//////////////////////////////////////////////////
	
		OSSemPend(pUSART2.sem, 0, &err);
	#endif /* OS_INCLUDED */
		USART2->__B.DR.DR = Data;
		while(!USART2->__B.SR.TXE);
	#ifdef OS_INCLUDED
		OSSemPost(pUSART2.sem);
	#endif /* OS_INCLUDED */
	return Data;
}

unsigned long int USART2Printf( const char *format, ...)
{
	unsigned long int i, cnt;
	char buf[128];
	va_list argptr;

	va_start(argptr, format);
	cnt = vsprintf(buf, format, argptr);
	va_end( argptr );

	for(i = 0;;i++)
	{
		if(buf[i] == 0) break;
		if(buf[i] == '\n') USART2PutToBuffer('\r');
		USART2PutToBuffer(buf[i]);
	}
	while(!USART2TxCheckByte())
	{
#ifdef OS_INCLUDED
	OSTimeDly(1);
#endif /* OS_INCLUDED */
	}
	return cnt;
}

//#define OS_INCLUDED

void USART2PutStr(unsigned char *Str, unsigned short int Length, int iEn)
{
	u32 i = 0;

	USART2BuffClear();
	
#ifdef OS_INCLUDED
	INT8U err;
	OSSemPend(pUSART2.sem, 0, &err);
#endif /* OS_INCLUDED */


	for(i = 0; i < Length; i++)
	{
		Tx2Buff[Tx2WrCnt++] = Str[i];
		if(Tx2WrCnt >= Tx2BuffLen) Tx2WrCnt = 0;
	}

	if(iEn)
	{
		USART2->__B.CR1.TXEIE = ENABLE;
	}	
#ifdef OS_INCLUDED
		OSSemPost(pUSART2.sem);
#endif /* OS_INCLUDED */
}

signed short int USART2RxGetByte(void)
{
	s16 RetVal = 0;

#ifndef OS_INCLUDED
	while(Rx2RdCnt == Rx2WrCnt);
#else
	if(Rx2RdCnt == Rx2WrCnt) return -1;
#endif

	RetVal = Rx2Buff[Rx2RdCnt%Rx2BuffLen];
	if(++Rx2RdCnt >= Rx2BuffLen) Rx2RdCnt = 0;

	return (RetVal & 0xff);
}

unsigned char USART2CheckByte(unsigned short int ByteCnt, unsigned short int *Recv)
{
	u32 i = 0, j = 0;
	u8 RetVal = TRUE;

	*Recv = 0;
	i = (u32) Rx2RdCnt;
	j = (u32) Rx2WrCnt;

	if(i == j) RetVal = FALSE;
	else if(i < j)
	{
		*Recv = j - i;
		i = i + ByteCnt;
		if(i > j) RetVal = FALSE;
	}
	else if(i > j)
	{
		*Recv = (Rx2BuffLen +j) - i;
		i = i + ByteCnt;
		j = j + Rx2BuffLen;
		if(i > j) RetVal = FALSE; 
	}
	return (RetVal);
}

void USART2BuffClear(void)
{
	Rx2RdCnt = 0;
	Rx2WrCnt = 0;
	Tx2RdCnt = 0;
	Tx2WrCnt = 0;
}

void USART2TxClear(void)
{
	Tx2RdCnt = 0;
	Tx2WrCnt = 0;
}

/*******************************************************************************
  * @brief  if the bytes have been transmitted, retrun true or not
  * @param  None
  * @retval TRUE/FALSE
  ******************************************************************************/

signed short int USART2TxCheckByte(void)
{
	if(Tx2RdCnt == Tx2WrCnt) return TRUE;
	else return FALSE;
}




/**
  * @brief  Initializes the USARTx peripheral Clock according to the 
  *         specified parameters in the USART_ClockInitStruct .
  * @param  USARTx: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure that
  *         contains the configuration information for the specified  USART peripheral.
  * @note   The Smart Card and Synchronous modes are not available for UART4 and UART5.    
  * @retval None
  */

/**
  * @brief  Fills each USART_ClockInitStruct member with its default value.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure
  *         which will be initialized.
  * @retval None
  */


/**
  * @brief  Enables or disables the specified USART peripheral.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USARTx peripheral.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */


/**
  * @brief  Sets the system clock prescaler.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  USART_Prescaler: specifies the prescaler clock. 
  * @note   The function is used for IrDA mode with UART4 and UART5.   
  * @retval None
  */

/**
  * @brief  Enables or disables the USART's 8x oversampling mode.
  * @note   This function has to be called before calling USART_Init() function
  *         in order to have correct baudrate Divider value.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USART 8x oversampling mode.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
  

/**
  * @brief  Enables or disables the USART's one bit sampling method.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USART one bit sampling method.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */

/**
  * @}
  */

